#include <iostream>
int main(){
    using namespace std;
    int n;
    cout << "整数値:";
    cin >> n;

    if ( n == 0){
        cout << "その値は0です" << endl;
    }
    else if(n >= 1 && n <= 9){//論理積 (真 && 真)の場合真になる
            cout << "その値は1桁です" << endl;
    }
    else if (n<=-10 ||n <= 10)//論理和 どちらか片方が真の場合、真になる 
    {
        
        cout << "その値は2桁です"<< endl;
    }
    else{
        cout << "その値は2桁以上です。" << endl;
    }

}



/* /if(n < -10 | 10 <=n){
    cout << "その値は2桁以上です" << endl;
    // 0| 0==0 ビット和
    // 0| 1 ==1
    // 1|0 == 1
    // 1| 1 == 1
    // 1101 | 0000 == 1101
    // 1010 | 1100 == 1110

    //ビット積
    //0 & 0 == 0
    //0 & 1 == 0
    //1 & 0 == 0
    //1 & 1 == 1
}*/

// 1010 | 1100 == 1110 ビット和

// 1010
// 1100
// ----
// 1110